Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
n after apply)
      + name                    = "log"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "azphotodevlog74889"
    }

  # module.user_assigned_identity.azurerm_role_assignment.this["app_acr_pull"] will be created
+ resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.user_assigned_identity.azurerm_role_assignment.this["app_key_vault_secrets_user"] will be created
+ resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.user_assigned_identity.azurerm_role_assignment.this["app_storage_blob_data_contributor"] will be created
+ resource "azurerm_role_assignment" "this" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.this["app"] will be created
+ resource "azurerm_user_assigned_identity" "this" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "azphoto-dev-app-mngid"
      + principal_id        = (known after apply)
      + resource_group_name = "azphoto-dev-rg"
      + tenant_id           = (known after apply)
    }

  # module.vm.azurerm_linux_virtual_machine.this["jumpbox"] will be updated in-place
~ resource "azurerm_linux_virtual_machine" "this" {
        id                              = "/subscriptions/14eac771-6a7b-423a-b6ca-d35eca40ba36/resourceGroups/azphoto-dev-rg/providers/Microsoft.Compute/virtualMachines/azphoto-dev-linux-vm"
        name                            = "azphoto-dev-linux-vm"
        tags                            = {}
        # (25 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "2e631930-da36-4c5a-bddf-b29c6f32c523" -> null
          - tenant_id    = "7be8e2c6-3f1e-47d6-a7e3-b4c7f5f69071" -> null
          - type         = "SystemAssigned" -> null
        }

        # (4 unchanged blocks hidden)
    }

Plan: 70 to add, 1 to change, 0 to destroy.

Changes to Outputs:
+ dns_zone_name_servers = {
      + app = (known after apply)
    }
+ mysql_server_fqdn     = {
      + app = (known after apply)
    }
+ redis_hostname        = {
      + app = (known after apply)
    }
+ vm_public_ip          = {
      + jumpbox = "20.194.200.143"
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p development`
* :put_litter_in_its_place: To **delete** this plan click [here](http://SandboxHost-638281213427529013:4141/lock?id=m-oka-system%252Fazphoto%252Fterraform%252Finfra%252Fenvs%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p development`
</details>
Plan: 70 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`